In [1]:
person = {
"first": "Jigyasa",
"last": "Sachdeva",
"email": "jigyasa.sachdeva24@gmail.com"
}

#Dictionary
#Key-value pair
person

{'first': 'Jigyasa',
 'last': 'Sachdeva',
 'email': 'jigyasa.sachdeva24@gmail.com'}

In [2]:
people = {
"first": ["Jigyasa", "Varun", "Chirag"],
"last": ["Sachdeva","Maheshwari", "Ahluwalia"],
"email": ["jigyasa.sachdeva24@gmail.com", "vm@gmail.com", "ca@gmail.com"]
}

#List
people

{'first': ['Jigyasa', 'Varun', 'Chirag'],
 'last': ['Sachdeva', 'Maheshwari', 'Ahluwalia'],
 'email': ['jigyasa.sachdeva24@gmail.com', 'vm@gmail.com', 'ca@gmail.com']}

In [3]:
people['email']
#Accessing email key

['jigyasa.sachdeva24@gmail.com', 'vm@gmail.com', 'ca@gmail.com']

In [4]:
import pandas as pd
df = pd.DataFrame(people)
#data frame from list of objects
df

     first        last                         email
0  Jigyasa    Sachdeva  jigyasa.sachdeva24@gmail.com
1    Varun  Maheshwari                  vm@gmail.com
2   Chirag   Ahluwalia                  ca@gmail.com

In [5]:
df['email']
#Shows series rather than series

0    jigyasa.sachdeva24@gmail.com
1                    vm@gmail.com
2                    ca@gmail.com
Name: email, dtype: object

In [6]:
type(df['email'])
#Series object: just like list with better functionality
#Data Frame is a container for series
#has index just like data frame

pandas.core.series.Series

In [7]:
df.email
#Can be done by using the .

0    jigyasa.sachdeva24@gmail.com
1                    vm@gmail.com
2                    ca@gmail.com
Name: email, dtype: object

In [8]:
type(df.email)
#Also a series

pandas.core.series.Series

In [9]:
#We prefer [''] version because . notation can access functions and columns both
# If there is a column called count, it will refer the function count

In [10]:
df[['email', 'first']]
#['email', 'first']: refers to a list being passed

                          email    first
0  jigyasa.sachdeva24@gmail.com  Jigyasa
1                  vm@gmail.com    Varun
2                  ca@gmail.com   Chirag

In [11]:
a = ['email', 'first']
#Making a list
df[a]
#Passing the list: same thing

                          email    first
0  jigyasa.sachdeva24@gmail.com  Jigyasa
1                  vm@gmail.com    Varun
2                  ca@gmail.com   Chirag

In [12]:
df.columns
#Gives us our columns

Index(['first', 'last', 'email'], dtype='object')

In [13]:
#For rows: loc and iloc
#loc: by labels
#iloc: integer location
df.iloc[0] #First

first                         Jigyasa
last                         Sachdeva
email    jigyasa.sachdeva24@gmail.com
Name: 0, dtype: object

In [14]:
df.iloc[0,1]
#0th row, 1st column -> Index

'Sachdeva'

In [15]:
df.iloc[[0,1]]
#Passing a list of indexes: 0 and 1 row indexes

     first        last                         email
0  Jigyasa    Sachdeva  jigyasa.sachdeva24@gmail.com
1    Varun  Maheshwari                  vm@gmail.com

In [16]:
df.iloc[[1,2], [0,1]]
#Syntax: df.iloc[ [rows indexes] , [columns indexes] ]

    first        last
1   Varun  Maheshwari
2  Chirag   Ahluwalia

In [17]:
df.iloc[[1,2], [2]]

          email
1  vm@gmail.com
2  ca@gmail.com

In [18]:
df.loc[[0,1],['email', 'last']]
#loc can be used to pass labels of columns names

                          email        last
0  jigyasa.sachdeva24@gmail.com    Sachdeva
1                  vm@gmail.com  Maheshwari

In [19]:
#setting a column as index/primary key for the table
df.set_index('email')
#email is far left and bold: index

#This would set the index as email temporarily and would change back if we print df

                                first        last
email
jigyasa.sachdeva24@gmail.com  Jigyasa    Sachdeva
vm@gmail.com                    Varun  Maheshwari
ca@gmail.com                   Chirag   Ahluwalia

In [20]:
df.set_index('email', inplace = True)
df

                                first        last
email
jigyasa.sachdeva24@gmail.com  Jigyasa    Sachdeva
vm@gmail.com                    Varun  Maheshwari
ca@gmail.com                   Chirag   Ahluwalia

In [21]:
df.index
#Indexes as list, name givem

Index(['jigyasa.sachdeva24@gmail.com', 'vm@gmail.com', 'ca@gmail.com'], dtype='object', name='email')

In [22]:
df.loc['jigyasa.sachdeva24@gmail.com']
#Now emails are used in place of index

first     Jigyasa
last     Sachdeva
Name: jigyasa.sachdeva24@gmail.com, dtype: object

In [23]:
df.iloc[0]
#iloc is integer ALWAYS

first     Jigyasa
last     Sachdeva
Name: jigyasa.sachdeva24@gmail.com, dtype: object

In [24]:
df.reset_index(inplace=True)

In [25]:
df

                          email    first        last
0  jigyasa.sachdeva24@gmail.com  Jigyasa    Sachdeva
1                  vm@gmail.com    Varun  Maheshwari
2                  ca@gmail.com   Chirag   Ahluwalia

In [26]:
people = {
"first": ["Jigyasa", "Deepanshu","Varun", "Chirag"],
"last": ["Sachdeva","Sachdeva","Maheshwari", "Ahluwalia"],
"email": ["jigyasa.sachdeva24@gmail.com", "ds@gmail.com","vm@gmail.com", "ca@gmail.com"]
}

In [27]:
df= pd.DataFrame(people)
#Creating filters

df['last']=='Sachdeva'
#Last name with Sachdeva

0     True
1     True
2    False
3    False
Name: last, dtype: bool

In [28]:
filter1 = df['last']=='Sachdeva'
df[filter1]
#OR
# df[df['last']=='Sachdeva']

       first      last                         email
0    Jigyasa  Sachdeva  jigyasa.sachdeva24@gmail.com
1  Deepanshu  Sachdeva                  ds@gmail.com

In [29]:
df.loc[ df['first']=='Jigyasa' , ['email']]
#Rows: df['first']=='Jigyasa'
#Columns: ['email']

                          email
0  jigyasa.sachdeva24@gmail.com

In [30]:
df.loc[(filter1) & (df['first']=='Deepanshu'), 'email']
#&: AND, |:OR

1    ds@gmail.com
Name: email, dtype: object

In [31]:
df.columns

Index(['first', 'last', 'email'], dtype='object')

In [32]:
#Changing column names

#Changing all names
df.columns = ['first_name', 'last_name', 'email']
df

  first_name   last_name                         email
0    Jigyasa    Sachdeva  jigyasa.sachdeva24@gmail.com
1  Deepanshu    Sachdeva                  ds@gmail.com
2      Varun  Maheshwari                  vm@gmail.com
3     Chirag   Ahluwalia                  ca@gmail.com

In [33]:
#Changing few column names
#Changing all lower/upper case
df.columns = [x.upper() for x in df.columns]
df
#Only worls when all characters are lower case

  FIRST_NAME   LAST_NAME                         EMAIL
0    Jigyasa    Sachdeva  jigyasa.sachdeva24@gmail.com
1  Deepanshu    Sachdeva                  ds@gmail.com
2      Varun  Maheshwari                  vm@gmail.com
3     Chirag   Ahluwalia                  ca@gmail.com

In [34]:
#replace '_' with space
df.columns = df.columns.str.replace('_', ' ')
df

  FIRST NAME   LAST NAME                         EMAIL
0    Jigyasa    Sachdeva  jigyasa.sachdeva24@gmail.com
1  Deepanshu    Sachdeva                  ds@gmail.com
2      Varun  Maheshwari                  vm@gmail.com
3     Chirag   Ahluwalia                  ca@gmail.com

In [35]:
#Reverting back:
df.columns = df.columns.str.replace(' ', '_')
df.columns = [x.lower() for x in df.columns]
df

  first_name   last_name                         email
0    Jigyasa    Sachdeva  jigyasa.sachdeva24@gmail.com
1  Deepanshu    Sachdeva                  ds@gmail.com
2      Varun  Maheshwari                  vm@gmail.com
3     Chirag   Ahluwalia                  ca@gmail.com

In [36]:
#Renaming specific columns:
df.rename(columns = {'first_name': 'first', 
                     'last_name': 'last'},
        inplace = True)

In [37]:
df

       first        last                         email
0    Jigyasa    Sachdeva  jigyasa.sachdeva24@gmail.com
1  Deepanshu    Sachdeva                  ds@gmail.com
2      Varun  Maheshwari                  vm@gmail.com
3     Chirag   Ahluwalia                  ca@gmail.com

### Updating data in the rows

In [38]:
#Updating entire row with index
df.loc[3] = ['Chirag', 'Gulati', 'cg@gmail.com']
df

       first        last                         email
0    Jigyasa    Sachdeva  jigyasa.sachdeva24@gmail.com
1  Deepanshu    Sachdeva                  ds@gmail.com
2      Varun  Maheshwari                  vm@gmail.com
3     Chirag      Gulati                  cg@gmail.com

In [39]:
df.loc[3, 'last'] = 'Ahluwalia'
df.loc[3, ['last', 'email']] = ['Ahluwalia', 'cah@gmail.com']
df
#We can use .at in place of .loc

       first        last                         email
0    Jigyasa    Sachdeva  jigyasa.sachdeva24@gmail.com
1  Deepanshu    Sachdeva                  ds@gmail.com
2      Varun  Maheshwari                  vm@gmail.com
3     Chirag   Ahluwalia                 cah@gmail.com

In [40]:
#Creating a filter, where email is cah@gmail.com; and then changing last name
filt = df['email'] == 'cah@gmail.com'
df.loc[filt, 'last'] = 'A'
df

       first        last                         email
0    Jigyasa    Sachdeva  jigyasa.sachdeva24@gmail.com
1  Deepanshu    Sachdeva                  ds@gmail.com
2      Varun  Maheshwari                  vm@gmail.com
3     Chirag           A                 cah@gmail.com

In [41]:
df['email'] = df['email'].str.lower()
df

       first        last                         email
0    Jigyasa    Sachdeva  jigyasa.sachdeva24@gmail.com
1  Deepanshu    Sachdeva                  ds@gmail.com
2      Varun  Maheshwari                  vm@gmail.com
3     Chirag           A                 cah@gmail.com

apply
map
applymap
replace

In [42]:
#apply
#applies function on series

#applying length function to a column:
df['email'].apply(len)

0    28
1    12
2    12
3    13
Name: email, dtype: int64

In [43]:
#Creating a function and then applying it

def update_email(email):
    return email.upper()
df['email'].apply(update_email)

#Can be applied permanently: 
#  df['email']= df['email'].apply(update_email)

0    JIGYASA.SACHDEVA24@GMAIL.COM
1                    DS@GMAIL.COM
2                    VM@GMAIL.COM
3                   CAH@GMAIL.COM
Name: email, dtype: object

In [44]:
df.apply(len)
#applying length function to all columns (each series) of the data frame

first    4
last     4
email    4
dtype: int64

In [45]:
#Applying on rows
df.apply(pd.Series.min)
#Minimum in each column

first           Chirag
last                 A
email    cah@gmail.com
dtype: object

In [46]:
#applymap: on all cells in the dataframe
df.applymap(len)
#Applying to each individual value

   first  last  email
0      7     8     28
1      9     8     12
2      5    10     12
3      6     1     13

In [47]:
#map iterates all values of a series
df['first'].map({'Jigyasa':'jigyasa'})

0    jigyasa
1        NaN
2        NaN
3        NaN
Name: first, dtype: object

In [48]:
#Only what is required in the series
df['first'].replace({'Jigyasa':'jigyasa'})

0      jigyasa
1    Deepanshu
2        Varun
3       Chirag
Name: first, dtype: object

In [49]:
#Concatenating Strings and creating a new column
df['FullName'] = df['first'] + ' ' + df['last']
df

       first        last                         email            FullName
0    Jigyasa    Sachdeva  jigyasa.sachdeva24@gmail.com    Jigyasa Sachdeva
1  Deepanshu    Sachdeva                  ds@gmail.com  Deepanshu Sachdeva
2      Varun  Maheshwari                  vm@gmail.com    Varun Maheshwari
3     Chirag           A                 cah@gmail.com            Chirag A

In [50]:
#Removing columns from table
df.drop(columns = ['first', 'last'], inplace = True)

In [51]:
df

                          email            FullName
0  jigyasa.sachdeva24@gmail.com    Jigyasa Sachdeva
1                  ds@gmail.com  Deepanshu Sachdeva
2                  vm@gmail.com    Varun Maheshwari
3                 cah@gmail.com            Chirag A

In [52]:
#Splitting 1 column to 2
df['FullName'].str.split(' ')

0      [Jigyasa, Sachdeva]
1    [Deepanshu, Sachdeva]
2      [Varun, Maheshwari]
3              [Chirag, A]
Name: FullName, dtype: object

In [53]:
#Assihgning this to 2 different columns
df['FullName'].str.split(' ', expand = True)

           0           1
0    Jigyasa    Sachdeva
1  Deepanshu    Sachdeva
2      Varun  Maheshwari
3     Chirag           A

In [54]:
df[['first', 'last']] = df['FullName'].str.split(' ', expand = True)
df

                          email            FullName      first        last
0  jigyasa.sachdeva24@gmail.com    Jigyasa Sachdeva    Jigyasa    Sachdeva
1                  ds@gmail.com  Deepanshu Sachdeva  Deepanshu    Sachdeva
2                  vm@gmail.com    Varun Maheshwari      Varun  Maheshwari
3                 cah@gmail.com            Chirag A     Chirag           A

In [55]:
#Adding and removing Rows

#Adding 1 row
df.append({'first':'Tony'}, ignore_index = True)

                          email            FullName      first        last
0  jigyasa.sachdeva24@gmail.com    Jigyasa Sachdeva    Jigyasa    Sachdeva
1                  ds@gmail.com  Deepanshu Sachdeva  Deepanshu    Sachdeva
2                  vm@gmail.com    Varun Maheshwari      Varun  Maheshwari
3                 cah@gmail.com            Chirag A     Chirag           A
4                           NaN                 NaN       Tony         NaN

In [56]:
#Appending a data frame to another
people = {
"first": ["Apple", "Banana"],
"last": ["Steve", "Man"]
}
df2 = pd.DataFrame(people)

In [57]:
df2

    first   last
0   Apple  Steve
1  Banana    Man

In [58]:
#Ignore index
df = df.append(df2, ignore_index = True)
df

                          email            FullName      first        last
0  jigyasa.sachdeva24@gmail.com    Jigyasa Sachdeva    Jigyasa    Sachdeva
1                  ds@gmail.com  Deepanshu Sachdeva  Deepanshu    Sachdeva
2                  vm@gmail.com    Varun Maheshwari      Varun  Maheshwari
3                 cah@gmail.com            Chirag A     Chirag           A
4                           NaN                 NaN      Apple       Steve
5                           NaN                 NaN     Banana         Man

In [59]:
df = df.loc[0:5]

In [60]:
df

                          email            FullName      first        last
0  jigyasa.sachdeva24@gmail.com    Jigyasa Sachdeva    Jigyasa    Sachdeva
1                  ds@gmail.com  Deepanshu Sachdeva  Deepanshu    Sachdeva
2                  vm@gmail.com    Varun Maheshwari      Varun  Maheshwari
3                 cah@gmail.com            Chirag A     Chirag           A
4                           NaN                 NaN      Apple       Steve
5                           NaN                 NaN     Banana         Man

In [61]:
df.drop(index = 4)

                          email            FullName      first        last
0  jigyasa.sachdeva24@gmail.com    Jigyasa Sachdeva    Jigyasa    Sachdeva
1                  ds@gmail.com  Deepanshu Sachdeva  Deepanshu    Sachdeva
2                  vm@gmail.com    Varun Maheshwari      Varun  Maheshwari
3                 cah@gmail.com            Chirag A     Chirag           A
5                           NaN                 NaN     Banana         Man

In [62]:
filt = df['first']=='Banana'
df = df.drop(index= df[filt].index)

In [63]:
df

                          email            FullName      first        last
0  jigyasa.sachdeva24@gmail.com    Jigyasa Sachdeva    Jigyasa    Sachdeva
1                  ds@gmail.com  Deepanshu Sachdeva  Deepanshu    Sachdeva
2                  vm@gmail.com    Varun Maheshwari      Varun  Maheshwari
3                 cah@gmail.com            Chirag A     Chirag           A
4                           NaN                 NaN      Apple       Steve

In [64]:
df= df.drop(4)

In [65]:
## Sort
df = df.append({'first':'Jigyasa', 'last':'Sachdeva', 'email':'jigyasa@gmail.com'}, ignore_index = True)
df.sort_values(by = 'last')

                          email            FullName      first        last
3                 cah@gmail.com            Chirag A     Chirag           A
2                  vm@gmail.com    Varun Maheshwari      Varun  Maheshwari
0  jigyasa.sachdeva24@gmail.com    Jigyasa Sachdeva    Jigyasa    Sachdeva
1                  ds@gmail.com  Deepanshu Sachdeva  Deepanshu    Sachdeva
4             jigyasa@gmail.com                 NaN    Jigyasa    Sachdeva

In [66]:
df.sort_values(by = 'last', ascending = False)

                          email            FullName      first        last
0  jigyasa.sachdeva24@gmail.com    Jigyasa Sachdeva    Jigyasa    Sachdeva
1                  ds@gmail.com  Deepanshu Sachdeva  Deepanshu    Sachdeva
4             jigyasa@gmail.com                 NaN    Jigyasa    Sachdeva
2                  vm@gmail.com    Varun Maheshwari      Varun  Maheshwari
3                 cah@gmail.com            Chirag A     Chirag           A

In [67]:
#Sort on 2 values: last and then first name
df.sort_values(by = ['last', 'first'])

                          email            FullName      first        last
3                 cah@gmail.com            Chirag A     Chirag           A
2                  vm@gmail.com    Varun Maheshwari      Varun  Maheshwari
1                  ds@gmail.com  Deepanshu Sachdeva  Deepanshu    Sachdeva
0  jigyasa.sachdeva24@gmail.com    Jigyasa Sachdeva    Jigyasa    Sachdeva
4             jigyasa@gmail.com                 NaN    Jigyasa    Sachdeva

In [68]:
#Last is descending and first in ascending
df.sort_values(by = ['last', 'first'], ascending = ['False', 'True'])

                          email            FullName      first        last
3                 cah@gmail.com            Chirag A     Chirag           A
2                  vm@gmail.com    Varun Maheshwari      Varun  Maheshwari
1                  ds@gmail.com  Deepanshu Sachdeva  Deepanshu    Sachdeva
0  jigyasa.sachdeva24@gmail.com    Jigyasa Sachdeva    Jigyasa    Sachdeva
4             jigyasa@gmail.com                 NaN    Jigyasa    Sachdeva

In [69]:
df = df.sort_index()
df

                          email            FullName      first        last
0  jigyasa.sachdeva24@gmail.com    Jigyasa Sachdeva    Jigyasa    Sachdeva
1                  ds@gmail.com  Deepanshu Sachdeva  Deepanshu    Sachdeva
2                  vm@gmail.com    Varun Maheshwari      Varun  Maheshwari
3                 cah@gmail.com            Chirag A     Chirag           A
4             jigyasa@gmail.com                 NaN    Jigyasa    Sachdeva